Repository: HotCakeX/Harden-Windows-Security
Catalog: Harden System Security/Strings/*/SecurityMeasures.resw
Source language: en_us
Languages: ar, de, el_gr, es, fr_fr, he_il, hi_in, ja_jp, ml_in, pl_pl, tr_tr

# DisableTLS11ClientPart1-TLS
source: Disable TLS v1.1 Client - Part 1
ar: تعطيل عميل TLS الإصدار 1.1 - الجزء 1
de: TLS v1.1-Client deaktivieren - Teil 1
el_gr: Απενεργοποίηση TLS v1.1 Client - Μέρος 1
es: Deshabilitar cliente TLS v1.1 - Parte 1
fr_fr: Désactiver le client TLS v1.1 - Partie 1
he_il: השבת לקוח TLS גרסה 1.1 - חלק 1
hi_in: TLS v1.1 क्लाइंट अक्षम करें - भाग 1
ja_jp: TLS v1.1 クライアントを無効にする - パート 1
ml_in: TLS v1.1 ക്ലയന്റ് നിർജ്ജീവമാക്കുക - ഭാഗം 1
pl_pl: Wyłącz klienta TLS v1.1 - Część 1
tr_tr: TLS v1.1 İstemcisini Devre Dışı Bırakma - Bölüm 1

# DisableTLS11ClientPart2-TLS
source: Disable TLS v1.1 Client - Part 2
ar: تعطيل عميل TLS الإصدار 1.1 - الجزء 2
de: TLS v1.1-Client deaktivieren - Teil 2
el_gr: Απενεργοποίηση TLS v1.1 Client - Μέρος 2
es: Deshabilitar cliente TLS v1.1 - Parte 2
fr_fr: Désactiver le client TLS v1.1 - Partie 2
he_il: השבת לקוח TLS גרסה 1.1 - חלק 2
hi_in: TLS v1.1 क्लाइंट अक्षम करें - भाग 2
ja_jp: TLS v1.1 クライアントを無効にする - パート 2
ml_in: TLS v1.1 ക്ലയന്റ് നിർജ്ജീവമാക്കുക - ഭാഗം 2
pl_pl: Wyłącz klienta TLS v1.1 - Część 2
tr_tr: TLS v1.1 İstemcisini Devre Dışı Bırakma - Bölüm 2

# DisableTLS11ServerPart1-TLS
source: Disable TLS v1.1 Server - Part 1
ar: تعطيل خادم TLS الإصدار 1.1 - الجزء 1
de: TLS v1.1-Server deaktivieren - Teil 1
el_gr: Απενεργοποίηση TLS v1.1 Server - Μέρος 1
es: Deshabilitar servidor TLS v1.1 - Parte 1
fr_fr: Désactiver le serveur TLS v1.1 - Partie 1
he_il: השבת שרת TLS גרסה 1.1 - חלק 1
hi_in: TLS v1.1 सर्वर अक्षम करें - भाग 1
ja_jp: TLS v1.1 サーバーを無効にする - パート 1
ml_in: TLS v1.1 സെർവർ നിർജ്ജീവമാക്കുക - ഭാഗം 1
pl_pl: Wyłącz serwer TLS v1.1 - Część 1
tr_tr: TLS v1.1 Sunucusunu Devre Dışı Bırakma - Bölüm 1

# DisableTLS11ServerPart2-TLS
source: Disable TLS v1.1 Server - Part 2
ar: تعطيل خادم TLS الإصدار 1.1 - الجزء 2
de: TLS v1.1-Server deaktivieren - Teil 2
el_gr: Απενεργοποίηση TLS v1.1 Server - Μέρος 2
es: Deshabilitar servidor TLS v1.1 - Parte 2
fr_fr: Désactiver le serveur TLS v1.1 - Partie 2
he_il: השבת שרת TLS גרסה 1.1 - חלק 2
hi_in: TLS v1.1 सर्वर अक्षम करें - भाग 2
ja_jp: TLS v1.1 サーバーを無効にする - パート 2
ml_in: TLS v1.1 സെർവർ നിർജ്ജീവമാക്കുക - ഭാഗം 2
pl_pl: Wyłącz serwer TLS v1.1 - Część 2
tr_tr: TLS v1.1 Sunucusunu Devre Dışı Bırakma - Bölüm 2

# CreateCustomEventViewerViews-Miscellaneous
source: Create custom views in the Windows Event Viewer for easy access to important security events.
ar: أنشئ طرق عرض مخصصة في عارض أحداث Windows للوصول السهل إلى أحداث الأمان المهمة.
de: Benutzerdefinierte Ansichten in der Windows-Ereignisanzeige erstellen, um einfachen Zugriff auf wichtige Sicherheitsereignisse zu erhalten.
el_gr: Δημιουργήστε προσαρμοσμένες προβολές στο Πρόγραμμα Προβολής Συμβάντων των Windows για εύκολη πρόσβαση σε σημαντικά συμβάντα ασφαλείας.
es: Cree vistas personalizadas en el Visor de eventos de Windows para acceder fácilmente a eventos de seguridad importantes.
fr_fr: Créer des vues personnalisées dans l'Observateur d'événements Windows pour un accès facile aux événements de sécurité importants.
he_il: צור תצוגות מותאמות אישית במציג האירועים של Windows לגישה קלה לאירועי אבטחה חשובים.
hi_in: महत्वपूर्ण सुरक्षा इवेंट्स तक आसान पहुँच के लिए Windows Event Viewer में कस्टम दृश्य बनाएँ.
ja_jp: 重要なセキュリティ イベントに簡単にアクセスできるように、Windows イベント ビューアーにカスタム ビューを作成する。
ml_in: പ്രധാന സുരക്ഷാ ഇവന്റുകളിൽ എളുപ്പത്തിൽ പ്രവേശിക്കാൻ Windows Event Viewer-ിൽ ഇഷ്ടാനുസൃത കാഴ്‌ചകൾ സൃഷ്ടിക്കുക.
pl_pl: Utwórz widoki niestandardowe w Podglądzie zdarzeń Windows, aby łatwo uzyskiwać dostęp do ważnych zdarzeń zabezpieczeń.
tr_tr: Önemli güvenlik olaylarına kolay erişim için Windows Olay Görüntüleyicisi'nde özel görünümler oluşturun.

# SecureSSHMACs-Miscellaneous
source: Configure the SSH client's configurations to use secure MACs (Message Authentication Codes).
ar: قم بتهيئة إعدادات عميل SSH لاستخدام شيفرات تحقق رسائل (MAC) آمنة (Message Authentication Codes).
de: SSH-Client so konfigurieren, dass sichere MACs (Message Authentication Codes) verwendet werden.
el_gr: Ρυθμίστε τις παραμέτρους του προγράμματος-πελάτη SSH ώστε να χρησιμοποιεί ασφαλή MAC (Message Authentication Codes).
es: Configure la configuración del cliente SSH para usar MAC seguros (Message Authentication Codes).
fr_fr: Configurer les configurations du client SSH pour utiliser des MAC sécurisés (Codes d'authentification de message).
he_il: הגדר את תצורת לקוח ה-SSH לשימוש ב-MAC מאובטחים (Message Authentication Codes).
hi_in: SSH क्लाइंट की कॉन्फ़िगरेशन को सुरक्षित MACs (Message Authentication Codes) उपयोग करने के लिए कॉन्फ़िगर करें.
ja_jp: 安全な MAC (メッセージ認証コード) を使用するように SSH クライアントの構成を設定する。
ml_in: സുരക്ഷിത MACs (Message Authentication Codes) ഉപയോഗിക്കുന്നതിനായി SSH ക്ലയന്റിന്റെ ക്രമീകരണം കോൺഫിഗർ ചെയ്യുക.
pl_pl: Skonfiguruj ustawienia klienta SSH, aby używać bezpiecznych MAC (Message Authentication Codes).
tr_tr: SSH istemcisinin yapılandırmalarını güvenli MAC'leri (Mesaj Kimlik Doğrulama Kodları) kullanacak şekilde yapılandırın.

# EnableOtherLogonLogOffAudit-Miscellaneous
source: Enable auditing and tracking Lock Screen locks and unlocks.
ar: مكّن التدقيق وتتبع عمليات قفل وفتح شاشة القفل.
de: Überwachung und Nachverfolgung von Sperren und Entsperren des Sperrbildschirms aktivieren.
el_gr: Ενεργοποιήστε την καταγραφή και την παρακολούθηση των ενεργειών κλειδώματος και ξεκλειδώματος της οθόνης κλειδώματος.
es: Habilite la auditoría y el seguimiento de los bloqueos y desbloqueos de la pantalla de bloqueo.
fr_fr: Activer l'audit et le suivi des verrouillages et déverrouillages de l'écran de verrouillage.
he_il: הפעל ביקורת ומעקב אחר פעולות נעילה ופתיחה של מסך הנעילה.
hi_in: Lock Screen को लॉक और अनलॉक करने की ऑडिटिंग तथा ट्रैकिंग सक्षम करें.
ja_jp: ロック画面のロックとロック解除の監査と追跡を有効にする。
ml_in: Lock Screen ലോക്കുകളും അൺലോക്കുകളും ഓഡിറ്റും ട്രാക്കിംഗും സജീവമാക്കുക.
pl_pl: Włącz inspekcję i śledzenie blokowania oraz odblokowywania ekranu blokady.
tr_tr: Kilit Ekranı kilitlerini ve kilit açma işlemlerini denetlemeyi ve izlemeyi etkinleştirin.

# ACConnectivityInStandby_BitLocker
source: Allow network connectivity during connected-modern-standby (only when plugged in)
ar: السماح باتصال الشبكة أثناء connected-modern-standby (فقط عند التوصيل بالطاقة)
de: Netzwerkverbindung während Connected-Modern-Standby zulassen (nur bei Netzbetrieb)
el_gr: Να επιτρέπεται η συνδεσιμότητα δικτύου κατά τη διάρκεια του connected-modern-standby (μόνο όταν είναι συνδεδεμένο στο ρεύμα)
es: Permitir la conectividad de red durante connected-modern-standby (solo cuando está conectado a la corriente)
fr_fr: Autoriser la connectivité réseau pendant la veille moderne connectée (uniquement lorsque branché)
he_il: אפשר קישוריות רשת במהלך connected-modern-standby (רק כאשר מחובר לחשמל)
hi_in: connected-modern-standby के दौरान नेटवर्क कनेक्टिविटी की अनुमति दें (केवल जब प्लग इन हो)
ja_jp: 接続モダン スタンバイ中のネットワーク接続を許可する (電源接続時のみ)
ml_in: connected-modern-standby സമയത്ത് നെറ്റ്‌വർക്ക് കണക്റ്റിവിറ്റി അനുവദിക്കുക (പ്ലഗ് ഇൻ ചെയ്തിരിക്കുന്നപ്പോൾ മാത്രം)
pl_pl: Zezwól na łączność sieciową podczas connected-modern-standby (tylko po podłączeniu do zasilania)
tr_tr: Bağlantılı modern bekleme sırasında ağ bağlantısına izin ver (yalnızca fişe takılıyken)

# Remediation_BNB_BFP_BruteForceProtection_MaxBlockTime-MSDefender
source: Set the maximum time an IP address is blocked by Brute-Force Protection to the maximum possible value. After this time, blocked IP addresses will be able to sign-in and initiate sessions.
ar: عيّن الحد الأقصى لمدة حظر عنوان IP بواسطة حماية الهجمات بالقوة الغاشمة إلى أعلى قيمة ممكنة. بعد هذه المدة، ستتمكن عناوين IP المحظورة من تسجيل الدخول وبدء الجلسات.
el_gr: Ορίστε τη μέγιστη διάρκεια για την οποία μια διεύθυνση IP αποκλείεται από την Προστασία Brute Force στη μέγιστη δυνατή τιμή. Μετά από αυτόν τον χρόνο, οι αποκλεισμένες διευθύνσεις IP θα μπορούν να συνδέονται και να εκκινούν συνεδρίες.
es: Establezca el tiempo máximo durante el cual una dirección IP queda bloqueada por la Protección contra ataques de fuerza bruta al valor máximo posible. Después de este tiempo, las direcciones IP bloqueadas podrán iniciar sesión e iniciar sesiones.
fr_fr: Définir le temps maximum pendant lequel une adresse IP est bloquée par la protection contre la force brute à la valeur maximale possible. Après ce délai, les adresses IP bloquées pourront se connecter et initier des sessions.
he_il: הגדר את משך הזמן המרבי שבו כתובת IP נחסמת באמצעות ההגנה מפני מתקפות Brute Force לערך המרבי האפשרי. לאחר זמן זה, כתובות IP שנחסמו יוכלו להתחבר ולהתחיל הפעלות.
ja_jp: ブルート フォース保護によって IP アドレスがブロックされる最大時間を、可能な限り最大の値に設定する。この時間が経過すると、ブロックされていた IP アドレスはサインインしてセッションを開始できるようになる。
tr_tr: Bir IP adresinin Kaba Kuvvet Koruması tarafından engelleneceği maksimum süreyi mümkün olan maksimum değere ayarlayın. Bu sürenin sonunda engellenen IP adresleri oturum açabilecek ve oturum başlatabilecektir.
